Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.1.203/PIC32CM-JH01/svd/PIC32CM2532JH01032.svd
            <cluster>
               <name>I2CS</name>
               <description>I2C Slave Mode</description>
               <alternateCluster>I2CM</alternateCluster>
               <headerStructName>SercomI2cs</headerStructName>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>CTRLA</name>
                  <description>I2CS Control A</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>MODE</name>
                        <description>Operating Mode</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>MODESelect</name>
                           <enumeratedValue>
                              <name>I2C_SLAVE</name>
                              <description>I2C slave operation</description>
                              <value>0x4</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RUNSTDBY</name>
                        <description>Run during Standby</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PINOUT</name>
                        <description>Pin Usage</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SDAHOLD</name>
                        <description>SDA Hold Time</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>SDAHOLDSelect</name>
                           <enumeratedValue>
                              <name>DIS</name>
                              <description>Disabled</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>75NS</name>
                              <description>50-100ns hold time</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>450NS</name>
                              <description>300-600ns hold time</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>600NS</name>
                              <description>400-800ns hold time</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SEXTTOEN</name>
                        <description>Slave SCL Low Extend Timeout</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SPEED</name>
                        <description>Transfer Speed</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>SPEEDSelect</name>
                           <enumeratedValue>
                              <name>SM</name>
                              <description>Standard-Mode (SM) and Fast-Mode (FM)</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FMP</name>
                              <description>Fast-Mode Plus (FM+)</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HS</name>
                              <description>High-Speed Mode</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SCLSM</name>
                        <description>SCL Clock Stretch Mode</description>
                        <bitOffset>27</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LOWTOUTEN</name>
                        <description>SCL Low Timeout Enable</description>
                        <bitOffset>30</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CTRLB</name>
                  <description>I2CS Control B</description>
                  <addressOffset>0x4</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SMEN</name>
                        <description>Smart Mode Enable</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>GCMD</name>
                        <description>PMBus Group Command</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>AACKEN</name>
                        <description>Automatic Address Acknowledge</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>AMODE</name>
                        <description>Address Mode</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>AMODESelect</name>
                           <enumeratedValue>
                              <name>MASK</name>
                              <description>The slave responds to the address written in ADDR.ADDR masked by the value in ADDR.ADDRMASK</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>2ADDRS</name>
                              <description>The slave responds to the two unique addresses in ADDR and ADDRMASK</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>RANGE</name>
                              <description>The slave responds to the range of addresses between and including ADDR and ADDRMASK. ADDR is the upper limit</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CMD</name>
                        <description>Command</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>ACKACT</name>
                        <description>Acknowledge Action</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENCLR</name>
                  <description>I2CS Interrupt Enable Clear</description>
                  <addressOffset>0x14</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>PREC</name>
                        <description>Stop Received Interrupt Disable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>AMATCH</name>
                        <description>Address Match Interrupt Disable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DRDY</name>
                        <description>Data Interrupt Disable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERROR</name>
                        <description>Combined Error Interrupt Disable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTENSET</name>
                  <description>I2CS Interrupt Enable Set</description>
                  <addressOffset>0x16</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>PREC</name>
                        <description>Stop Received Interrupt Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>AMATCH</name>
                        <description>Address Match Interrupt Enable</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DRDY</name>
                        <description>Data Interrupt Enable</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERROR</name>
                        <description>Combined Error Interrupt Enable</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>INTFLAG</name>
                  <description>I2CS Interrupt Flag Status and Clear</description>
                  <addressOffset>0x18</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>PREC</name>
                        <description>Stop Received Interrupt</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>AMATCH</name>
                        <description>Address Match Interrupt</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DRDY</name>
                        <description>Data Interrupt</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ERROR</name>
                        <description>Combined Error Interrupt</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>STATUS</name>
                  <description>I2CS Status</description>
                  <addressOffset>0x1A</addressOffset>
                  <size>16</size>
                  <resetValue>0x0000</resetValue>
                  <fields>
                     <field>
                        <name>BUSERR</name>
                        <description>Bus Error</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>COLL</name>
                        <description>Transmit Collision</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>RXNACK</name>
                        <description>Received Not Acknowledge</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DIR</name>
                        <description>Read/Write Direction</description>
                        <bitOffset>3</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SR</name>
                        <description>Repeated Start</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>LOWTOUT</name>
                        <description>SCL Low Timeout</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CLKHOLD</name>
                        <description>Clock Hold</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>SEXTTOUT</name>
                        <description>Slave SCL Low Extend Timeout</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>HS</name>
                        <description>High Speed</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>SYNCBUSY</name>
                  <description>I2CS Synchronization Busy</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>SWRST</name>
                        <description>Software Reset Synchronization Busy</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ENABLE</name>
                        <description>SERCOM Enable Synchronization Busy</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>ADDR</name>
                  <description>I2CS Address</description>
                  <addressOffset>0x24</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>GENCEN</name>
                        <description>General Call Address Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ADDR</name>
                        <description>Address Value</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>10</bitWidth>
                     </field>
                     <field>
                        <name>TENBITEN</name>
                        <description>Ten Bit Addressing Enable</description>
                        <bitOffset>15</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>ADDRMASK</name>
                        <description>Address Mask</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>10</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DATA</name>
                  <description>I2CS Data</description>
                  <addressOffset>0x28</addressOffset>
                  <size>8</size>
                  <resetValue>0x00</resetValue>
                  <fields>
                     <field>
                        <name>DATA</name>
                        <description>Data Value</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>8</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
